# Proyecto

Contenido:

1. Importar Librerías
2. Lectura de Conjunto
3. Limpieza de datos
    1. Columna Age
    2. Limpieza de la variable embarqued
    3. Cambiar la columna sex
    4. Cambiar la variable embarked
    5. Variable Child
    6. Eliminar columnas
    7. Valiar que no existan duplicados
    8. Listar valorees únicos 
    9. Quitar espacios en blanco
    10. Cambiar nombre de variables
    11. Mostrar estadísticos 
    12. Guardar datos
    13. Excel

## Importar Librerías

In [1]:
import numpy as np
import pandas as pd

## Lectura de conjunto de datos

In [2]:
url = 'http://raw.githubusercontent.com/omarmendoza564/datos/main/datos/titanic.csv'

In [3]:
titanic = pd.read_csv(url)
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [4]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1310 entries, 0 to 1309
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   float64
 1   survived   1309 non-null   float64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   float64
 6   parch      1309 non-null   float64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(7), object(7)
memory usage: 143.4+ KB

## Limpieza de Datos

### 1. Limpieza de la columna Age

In [5]:
mean = titanic['age'].mean()
mean

29.8811345124283

In [6]:
titanic['age'].fillna(mean)

0       29.000000
1        0.916700
2        2.000000
3       30.000000
4       25.000000
          ...
1305    29.881135
1306    26.500000
1307    27.000000
1308    29.000000
1309    29.881135
Name: age, Length: 1310, dtype: float64

In [7]:
titanic['age'] = titanic['age'].fillna(mean)

### 2. Limpieza de la variable embarqued

In [8]:
titanic['embarked']

0         S
1         S
2         S
3         S
4         S
       ...
1305      C
1306      C
1307      C
1308      S
1309    NaN
Name: embarked, Length: 1310, dtype: object

In [9]:
titanic['embarked'].fillna('S')

0       S
1       S
2       S
3       S
4       S
       ..
1305    C
1306    C
1307    C
1308    S
1309    S
Name: embarked, Length: 1310, dtype: object

In [10]:
titanic['embarked'] = titanic['embarked'].fillna('S')

### 3. Cambiar la columna sex

In [11]:
titanic['sex']

0       female
1         male
2       female
3         male
4       female
         ...
1305    female
1306      male
1307      male
1308      male
1309       NaN
Name: sex, Length: 1310, dtype: object

In [12]:
titanic['sex'].isna().sum()

1

In [13]:
titanic['sex'] = titanic['sex'].fillna('male')

In [14]:
titanic['sex'].apply(lambda x: 1 if x == 'female' else 0)

0       1
1       0
2       1
3       0
4       1
       ..
1305    1
1306    0
1307    0
1308    0
1309    0
Name: sex, Length: 1310, dtype: int64

In [15]:
titanic['sex'] = titanic['sex'].apply(lambda x: 1 if x == 'female' else 0)

### 4. Cambiar la variable embarked

In [16]:
titanic['embarked']

0       S
1       S
2       S
3       S
4       S
       ..
1305    C
1306    C
1307    C
1308    S
1309    S
Name: embarked, Length: 1310, dtype: object

In [17]:
def changeEmbarked(embarked):
    if embarked == 'S':
        return 0
    elif embarked == 'C':
        return 1
    elif embarked == 'Q':
        return 2
    else:
        return 0

In [18]:
titanic['embarked'] = titanic['embarked'].apply(changeEmbarked)

### 5. Variable Child

In [19]:
titanic['age'].apply(lambda x:  1 if x < 16 else 0)

0       0
1       1
2       1
3       0
4       0
       ..
1305    0
1306    0
1307    0
1308    0
1309    0
Name: age, Length: 1310, dtype: int64

In [20]:
titanic['child'] = titanic['age'].apply(lambda x:  1 if x < 16 else 0)

In [21]:
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,child
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",1,29.0000,0.0,0.0,24160,211.3375,B5,0,2,NaN,"St Louis, MO",0
1,1.0,1.0,"Allison, Master. Hudson Trevor",0,0.9167,1.0,2.0,113781,151.5500,C22 C26,0,11,NaN,"Montreal, PQ / Chesterville, ON",1
2,1.0,0.0,"Allison, Miss. Helen Loraine",1,2.0000,1.0,2.0,113781,151.5500,C22 C26,0,NaN,NaN,"Montreal, PQ / Chesterville, ON",1
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",0,30.0000,1.0,2.0,113781,151.5500,C22 C26,0,NaN,135.0,"Montreal, PQ / Chesterville, ON",0
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,25.0000,1.0,2.0,113781,151.5500,C22 C26,0,NaN,NaN,"Montreal, PQ / Chesterville, ON",0

### 6. Eliminar columnas

In [22]:
titanic.drop(columns=['ticket', 'cabin', 'sibsp'], inplace=True)
titanic.head()

,pclass,survived,name,sex,age,parch,fare,embarked,boat,body,home.dest,child
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",1,29.0000,0.0,211.3375,0,2,NaN,"St Louis, MO",0
1,1.0,1.0,"Allison, Master. Hudson Trevor",0,0.9167,2.0,151.5500,0,11,NaN,"Montreal, PQ / Chesterville, ON",1
2,1.0,0.0,"Allison, Miss. Helen Loraine",1,2.0000,2.0,151.5500,0,NaN,NaN,"Montreal, PQ / Chesterville, ON",1
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",0,30.0000,2.0,151.5500,0,NaN,135.0,"Montreal, PQ / Chesterville, ON",0
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,25.0000,2.0,151.5500,0,NaN,NaN,"Montreal, PQ / Chesterville, ON",0

### 7. Valiar que no existan duplicados

In [23]:
titanic.duplicated().sum()

0

### 8. Listar valorees únicos

In [24]:
titanic['sex'].unique()

array([1, 0])

### 9. Quitar espacios en blanco

In [25]:
titanic['name'].str.strip()

0                         Allen, Miss. Elisabeth Walton
1                        Allison, Master. Hudson Trevor
2                          Allison, Miss. Helen Loraine
3                  Allison, Mr. Hudson Joshua Creighton
4       Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
                             ...
1305                              Zabour, Miss. Thamine
1306                          Zakarian, Mr. Mapriededer
1307                                Zakarian, Mr. Ortin
1308                                 Zimmerman, Mr. Leo
1309                                                NaN
Name: name, Length: 1310, dtype: object

In [26]:
titanic['name'] = titanic['name'].str.strip()

In [27]:
titanic['home.dest'].str.strip()

0                          St Louis, MO
1       Montreal, PQ / Chesterville, ON
2       Montreal, PQ / Chesterville, ON
3       Montreal, PQ / Chesterville, ON
4       Montreal, PQ / Chesterville, ON
                     ...
1305                                NaN
1306                                NaN
1307                                NaN
1308                                NaN
1309                                NaN
Name: home.dest, Length: 1310, dtype: object

In [28]:
titanic['home.dest'] = titanic['home.dest'].str.strip()

### 10. Cambiar nombre de variables

In [29]:
titanic.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'parch', 'fare', 'embarked',
       'boat', 'body', 'home.dest', 'child'],
      dtype='object')

In [30]:
columns = ['tipo_boleto', 'sobrevivio', 'nombre', 'genero', 'edad', 'num_padres', 'costo_boleto', 'puerto', 'salvavidas', 'numero_cuerpo', 'origen-destino', 'joven']

In [31]:
titanic.columns = columns
titanic.head(3)

,tipo_boleto,sobrevivio,nombre,genero,edad,num_padres,costo_boleto,puerto,salvavidas,numero_cuerpo,origen-destino,joven
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",1,29.0000,0.0,211.3375,0,2,NaN,"St Louis, MO",0
1,1.0,1.0,"Allison, Master. Hudson Trevor",0,0.9167,2.0,151.5500,0,11,NaN,"Montreal, PQ / Chesterville, ON",1
2,1.0,0.0,"Allison, Miss. Helen Loraine",1,2.0000,2.0,151.5500,0,NaN,NaN,"Montreal, PQ / Chesterville, ON",1

### 11. Mostrar estadísticos

In [32]:
titanic['edad'].describe()

count    1310.000000
mean       29.881135
std        12.878277
min         0.166700
25%        22.000000
50%        29.881135
75%        35.000000
max        80.000000
Name: edad, dtype: float64

In [33]:
new_df = titanic[titanic['genero'] == 1][['nombre', 'puerto', 'edad']]
new_df

                                               nombre  puerto       edad
0                       Allen, Miss. Elisabeth Walton       0  29.000000
2                        Allison, Miss. Helen Loraine       0   2.000000
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)       0  25.000000
6                   Andrews, Miss. Kornelia Theodosia       0  63.000000
8       Appleton, Mrs. Edward Dale (Charlotte Lamson)       0  53.000000
...                                               ...     ...        ...
1286  Whabee, Mrs. George Joseph (Shawneene Abi-Saab)       1  38.000000
1290                 Wilkes, Mrs. James (Ellen Needs)       0  47.000000
1300          Yasbeck, Mrs. Antoni (Selini Alexander)       1  15.000000
1304                             Zabour, Miss. Hileni       1  14.500000
1305                            Zabour, Miss. Thamine       1  29.881135

[466 rows x 3 columns]

### 12. Guardar datos

In [34]:
titanic.to_json('RDLC_titanic_clean.json')

### 13. Excel

In [35]:
titanic[titanic['sobrevivio'] == 1].to_excel('RDLC_titanic_clean.xlsx', sheet_name='Sobrevivientes')

In [ ]:
with pd.ExcelWriter('RDLC_titanic_clean.xlsx', mode='a') as writer:
    titanic[titanic['sobrevivio'] == 0].to_excel(writer, sheet_name='Fallecidos')